# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
aloxaf/fzf-tab 

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# vi mode
jeffreytse/zsh-vi-mode

# aliases
MichaelAquilina/zsh-you-should-use
# ohmyzsh/ohmyzsh path:plugins/git

# prompt
romkatv/powerlevel10k

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
